<details ><summary>apply for fundaztic 2025-08-11 06:08:26 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#fundaztic has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_objectstorage_bucket.test_bucket will be created
  + resource "oci_objectstorage_bucket" "test_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaanv2iw5bemlavv5suwpfgm3bj44vy32wzjiemxhg7kzqdvywwmopa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "my-test-bucket"
      + namespace                    = "ax1h9bph8nyo"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
oci_objectstorage_bucket.test_bucket: Creating...
oci_objectstorage_bucket.test_bucket: Creation complete after 2s [id=n/ax1h9bph8nyo/b/my-test-bucket]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>

</details>